app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("image", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "0adpkkj--300x231.jpeg"], ["content", "金閣"], ["created_at", "2021-12-12 18:59:28.424731"], ["updated_at", "2021-12-12 18:59:28.424731"], ["user_id", 12]]
---
  def create
    @picture = Picture.new(picture_params)
    @picture.user_id = current_user.id
    respond_to do |format|
      if @picture.save

UPDATE "pictures" SET "image" = $1, "content" = $2, "updated_at" = $3 WHERE "pictures"."id" = $4  [["image", "0adpDSC_1114--300x200.jpeg"], ["content", "鳥居"], ["updated_at", "2021-12-12 19:14:27.290103"], ["id", 20]]
---
  def update
    respond_to do |format|
      if @picture.update(picture_params)