app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "image" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["image", "greeenPAR566721764.jpg.webp"], ["updated_at", "2021-12-12 12:22:23.080318"], ["id", 7]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)